In [1]:
import numpy as np
import pandas as pd
import random

In [2]:
np.random.seed(29)


### 1. How likely is it that you roll doubles when rolling two dice?

In [3]:
#first, create an array representing 1,000,000 rolls of 2 dice
n_trials = nrows = 100_000
n_dice = ncols = 2
#here's your "roll": there are six possibilities
rolls = np.random.choice([1,2,3,4,5,6], n_trials * n_dice).reshape(nrows, ncols)
rolls
#and of course, reshaped correctly for exercise : )

array([[6, 4],
       [5, 6],
       [3, 1],
       ...,
       [5, 6],
       [5, 5],
       [6, 5]])

In [4]:
rolls.shape

(100000, 2)

In [5]:
#get it in a DF
rolls = pd.DataFrame(rolls, columns=['first_roll','second_roll'])
rolls.head()

   first_roll  second_roll
0           6            4
1           5            6
2           3            1
3           1            2
4           2            1

In [6]:
#in this example, i've created a function to count when they are the same
def count_doubles(row):
    return row.first_roll == row.second_roll
count_doubles
#and here, i create a new column full of booleans for when they are the same
rolls['doubles_count'] = rolls.apply(count_doubles, axis=1)
rolls.sample(20)

       first_roll  second_roll  doubles_count
78173           1            2          False
51121           1            3          False
60356           4            3          False
24304           2            4          False
77590           6            5          False
24491           6            3          False
11290           4            2          False
30277           4            5          False
56875           2            6          False
76125           5            4          False
30266           3            2          False
74481           2            6          False
25534           6            4          False
39360           5            4          False
98654           4            1          False
21040           4            4           True
94245           3            5          False
64548           4            5          False
98152           5            4          False
64276           1            2          False

In [7]:
#finally, get the average of where the two are the same
(rolls.doubles_count==True).mean()

0.16645

In [8]:
#or what john did:
rolls.apply(lambda row: row.values[0]==row.values[1],axis=1).mean()

0.16645

# classroom answer

In [9]:
#compare to github

In [10]:
rolls.apply(lambda row: row.values[0]==row.values[1],axis=1).mean()

0.16645

In [11]:
rolls.apply(lambda row: row[0]==row[1],axis=1).mean()

0.16645

### 2. If you flip 8 coins, what is the probability of getting exactly 3 heads? What is the probability of getting more than 3 heads?

In [12]:
n_trials = 100_000
n_coins = 8
#similar to above ex, but here we're just using a true/false choice and avoiding having to reshape
flips = np.random.choice([0,1], size=(n_trials, n_coins))
flips

array([[1, 1, 0, ..., 1, 1, 1],
       [1, 0, 1, ..., 1, 0, 1],
       [1, 0, 0, ..., 0, 0, 1],
       ...,
       [0, 0, 0, ..., 1, 1, 1],
       [0, 1, 1, ..., 1, 0, 0],
       [1, 0, 1, ..., 0, 1, 0]])

In [13]:
flips.shape

(100000, 8)

In [14]:
flips = pd.DataFrame(flips)
flips.sample(10)

       0  1  2  3  4  5  6  7
30567  1  1  1  0  1  0  0  1
98537  0  0  1  0  1  1  1  0
54774  1  1  1  0  1  1  1  0
75432  1  1  0  0  1  0  0  1
75058  1  1  1  0  1  0  1  1
24667  0  1  0  1  0  0  1  1
66897  1  0  0  1  0  1  1  1
77787  0  0  0  1  1  0  1  1
36464  1  1  0  0  1  0  1  0
43005  1  1  0  1  1  1  0  0

In [15]:
#add a counter for the number of heads in our series
flips['n_heads'] = flips.sum(axis=1)
flips.sample(10)

       0  1  2  3  4  5  6  7  n_heads
68862  0  0  1  1  0  1  0  0        3
45968  1  0  0  0  0  0  1  0        2
11275  1  0  1  0  1  1  1  1        6
37370  0  1  0  1  0  1  0  1        4
24146  1  0  0  0  0  0  1  1        3
92690  0  0  1  1  0  0  0  1        3
37675  1  0  1  1  1  0  0  0        4
2877   0  0  0  0  0  0  1  1        2
600    1  0  1  0  0  1  1  0        4
92170  0  1  1  0  1  0  0  0        3

In [16]:
#and get the average
(flips.n_heads == 3).mean()

0.22002

In [62]:
(flips.n_heads > 3).mean()

0.63828

### 3. There are approximitely 3 web development cohorts for every 1 data science cohort at Codeup. Assuming that Codeup randomly selects an alumni to put on a billboard, what are the odds that the two billboards I drive past both have data science students on them?

In [63]:
n_trials = 100_000
n_billboards = 2

#get our array.  4 choices here; we'll say that '3' == ds student

billboards = np.random.choice([0,1,2,3], size=(n_trials, n_billboards))
billboards

array([[1, 0],
       [1, 1],
       [2, 2],
       ...,
       [3, 3],
       [3, 2],
       [0, 0]])

In [64]:
billboards = pd.DataFrame(billboards, columns=['first_bb','second_bb'])
billboards.head()

   first_bb  second_bb
0         1          0
1         1          1
2         2          2
3         1          1
4         0          0

In [65]:
#add a row that returns a boolean if both billboards were a '3'
billboards['ds_count'] = (billboards.first_bb == 3) & (billboards.second_bb == 3)
billboards.sample(10)

       first_bb  second_bb  ds_count
87980         0          3     False
88439         1          0     False
89231         2          0     False
71391         3          0     False
74366         1          3     False
48167         0          3     False
5953          2          2     False
16073         2          1     False
6019          1          0     False
49686         2          0     False

In [66]:
#and the average of ds_count == true (meaning both were ds students)
billboards.ds_count.mean()

0.06216

In [69]:
#john's code.  almost identical, but i like the use of 'DS' and 'WEB' vs 0 and 1
nrows = 100_000 # set rows to number of simulations
ncols = 2       # set columns to number of bilboards in each simulation

# create an array of of values using random choice to repesent weather a given billboard is data science or web dev
# reshabe that array into trial groups of 2
rolls = np.random.choice(["DS","WEB","WEB","WEB"], nrows * ncols).reshape(nrows, ncols)

# convert to data frame
df = pd.DataFrame(rolls)
df.head()

     0    1
0  WEB   DS
1  WEB  WEB
2  WEB  WEB
3  WEB  WEB
4  WEB   DS

In [71]:
#john's idea:
both_ds = df.apply(lambda row: (row.values[0] == "DS") and (row.values[1] == "DS"), axis=1).mean()

print(f'The odds of both billboards being Data Science are {round(both_ds*100)}%')

The odds of both billboards being Data Science are 6%

### 4. Codeup students buy, on average, 3 poptart packages with a standard deviation of 1.5 a day from the snack vending machine. If on monday the machine is restocked with 17 poptart packages, how likely is it that I will be able to buy some poptarts on Friday afternoon? (Remember, if you have mean and standard deviation, use the np.random.normal)

In [74]:
#here, we use np.random.normal to get our array, which is 5 (for 5 days) long, each value representing
#how many poptarts were bought that day.
nrows=100000
ncols=5
mu, sigma = 3, 1.5
# s = np.random.normal(mu,sigma,size = (100_000,5))
# s

s = np.random.normal(mu,sigma,nrows*ncols).astype(int).reshape(nrows,ncols) #better to convert to integer
#johns df was all integers and resulted in a higher % than mine

In [75]:
#where the sum of them is less than 17 means there should be some left

(s.sum(axis=1) < 17).mean()

0.88078

### 5. Compare Heights

- Men have an average height of 178 cm and standard deviation of 8cm.
- Women have a mean of 170, sd = 6cm.
- Since you have means and standard deviations, you can use np.random.normal to generate observations.
- If a man and woman are chosen at random, P(woman taller than man)?

In [76]:
#johns idea:
# df=pd.DataFrame({'men': men,
#                 'women': women})

In [77]:
#similarly: 100_000 samples, but only 1 in each array
mu, sigma = 178, 8
men = np.random.normal(mu,sigma,size = (100_000,1))
men = pd.DataFrame(men)
men

                0
0      183.037440
1      174.207626
2      170.611857
3      183.956181
4      161.423891
...           ...
99995  184.293190
99996  186.695866
99997  183.422892
99998  189.591497
99999  179.914183

[100000 rows x 1 columns]

In [78]:
mu, sigma = 170, 6
women = np.random.normal(mu,sigma,size = (100_000,1))
women = pd.DataFrame(women)
women

                0
0      161.176872
1      181.260777
2      168.014424
3      163.955712
4      165.735250
...           ...
99995  164.305195
99996  166.739906
99997  164.050752
99998  174.448419
99999  173.106044

[100000 rows x 1 columns]

In [79]:
#since the arrays are identical, we can do a direct comparison
#see john's code above to jam them in the same DF
(women > men).mean()

0    0.21037
dtype: float64

### 6. When installing anaconda on a student's computer, there's a 1 in 250 chance that the download is corrupted and the installation fails. What are the odds that after having 50 students download anaconda, no one has an installation issue? 100 students?

In [80]:
n_trials = 100_000
n_installs = 50
#0 == fails, 1 == succeeds
installs = np.random.choice([0,1], size=(n_trials, n_installs), p=(1/250,249/250))
installs

array([[1, 1, 1, ..., 1, 1, 1],
       [1, 1, 1, ..., 1, 1, 1],
       [1, 1, 1, ..., 1, 1, 1],
       ...,
       [1, 1, 1, ..., 1, 1, 1],
       [1, 1, 1, ..., 1, 1, 1],
       [1, 1, 1, ..., 1, 1, 1]])

In [81]:
installs = pd.DataFrame(installs)
installs

,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
0,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
1,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
3,1,1,1,1,1,1,0,1,1,1,...,1,1,1,1,1,1,1,1,1,1
4,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
99996,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
99997,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
99998,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
99999,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1

In [82]:
#get a count of how many times all the installs were fine; 50 means they were all good
installs['count'] = installs.sum(axis=1)
installs.sample(10)

,0,1,2,3,4,5,6,7,8,9,...,41,42,43,44,45,46,47,48,49,count
19325,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,50
18309,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,50
54502,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,50
38095,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,50
53341,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,50
45511,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,50
42301,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,50
58277,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,49
86852,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,50
14628,1,1,1,1,1,1,1,1,1,1,...,1,1,1,0,1,1,1,1,1,49

In [83]:
#the average of where the count was exactly 50, meaning all installs were good

(installs['count'] == 50).mean()

0.81841

In [85]:
#for 100 students:

n_trials = 100_000
n_installs = 100
installs = np.random.choice([0,1], size=(n_trials, n_installs), p=(1/250,249/250))
installs = pd.DataFrame(installs)
installs['count'] = installs.sum(axis=1)

(installs['count'] == 100).mean()



#this particular answer looks like it came out wrong. 
#comparing to john's answer, looks ok after all

0.67001


### What is the probability that we observe an installation issue within the first 150 students that download anaconda?

In [86]:
#for 150 students:
n_trials = 100_000
n_installs = 150
#0 == fails, 1 == succeeds
installs = np.random.choice([0,1], size=(n_trials, n_installs), p=(1/250,249/250))
installs = pd.DataFrame(installs)
installs['count'] = installs.sum(axis=1)

(installs['count'] != 150).mean()

0.45126

### How likely is it that 450 students all download anaconda without an issue?

In [87]:
#for 450  students:
n_trials = 100_000
n_installs = 450
#0 == fails, 1 == succeeds
installs = np.random.choice([0,1], size=(n_trials, n_installs), p=(1/250,249/250))
installs = pd.DataFrame(installs)
installs['count'] = installs.sum(axis=1)

(installs['count'] == 450).mean()

0.16519

### 7. There's a 70% chance on any given day that there will be at least one food truck at Travis Park. However, you haven't seen a food truck there in 3 days. How unlikely is this?

In [88]:
n_trials = 100_000
n_days = 3
#0 = no food trucks; 1=yes food trucks
food_truck = np.random.choice([0,1], size=(n_trials, n_days), p=(.3,.7))
food_truck = pd.DataFrame(food_truck)
food_truck.sample(10)
#below, then, is our sample of food truck presence on 3 consecutive days

       0  1  2
8526   1  1  1
73001  1  1  1
77230  1  1  0
64279  1  1  0
48304  1  0  1
14993  1  0  0
88042  0  1  0
6133   1  1  1
69270  0  1  0
24444  1  1  0

In [89]:
food_truck['ft_count'] = food_truck.sum(axis=1)
food_truck

       0  1  2  ft_count
0      1  1  1         3
1      0  0  1         1
2      1  0  1         2
3      1  1  1         3
4      0  1  1         2
...   .. .. ..       ...
99995  1  1  0         2
99996  1  0  1         2
99997  1  1  1         3
99998  1  1  1         3
99999  1  1  1         3

[100000 rows x 4 columns]

In [90]:
#here's our likelyhood of having no food trucks in 3 consecutive days:
(food_truck.ft_count == 0).mean()

0.02735

### How likely is it that a food truck will show up sometime this week?

In [91]:
n_trials = 100_000
n_days = 7
#0 = no food trucks; 1=yes food trucks
food_truck = np.random.choice([0,1], size=(n_trials, n_days), p=(.3,.7))
food_truck = pd.DataFrame(food_truck)
food_truck['ft_count'] = food_truck.sum(axis=1)
food_truck.sample(10)

#below, then, is our sample of food truck presence on 7 consecutive days

       0  1  2  3  4  5  6  ft_count
6966   1  1  1  0  1  1  1         6
84095  1  1  1  0  1  0  1         5
34224  1  1  0  1  0  1  1         5
15135  0  1  1  1  1  1  1         6
20305  0  1  1  1  1  1  1         6
88071  0  1  0  1  0  1  1         4
74086  1  1  0  1  1  1  0         5
29715  1  0  1  1  0  1  1         5
66871  1  1  1  1  1  1  1         7
40153  1  1  1  0  1  1  0         5

In [92]:
#here's our likelyhood of having a food truck on 1 day this week:
(food_truck.ft_count != 0).mean()

0.99984

### 8. If 23 people are in the same room, what are the odds that two of them share a birthday?

In [39]:
from math import comb

comb(23,2)

253

In [113]:
n_trials = 100_000
n_bdays = 23
#i need to assign a numbered birthday to each person in the trial, then see if the total is n or less
birthday = np.random.choice([r for r in range(366)],size = (n_trials, n_bdays))
birthday = pd.DataFrame(birthday)
#good up to here, but i need to check unique values, not just sum up. 'nunique' will work
birthday['unique_bdays'] = birthday.nunique(axis = 1)
birthday.sample(10)

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,unique_bdays
31728,165,142,306,314,251,116,173,10,322,171,...,92,351,278,231,187,275,342,298,340,22
32313,117,153,82,136,202,364,109,134,297,325,...,52,179,248,212,313,42,325,149,47,22
29922,25,283,365,48,362,167,209,13,19,292,...,210,228,344,201,335,129,207,20,166,23
37783,16,334,229,120,291,73,202,275,249,320,...,234,317,359,150,220,223,104,314,227,22
30525,176,330,237,256,324,286,298,218,85,305,...,169,148,357,21,358,160,257,289,192,23
86855,24,292,250,61,226,33,40,270,56,67,...,358,45,313,176,101,173,93,319,97,23
46477,2,312,196,28,122,311,13,198,187,99,...,60,151,31,296,237,168,354,116,178,23
8645,103,140,6,235,158,330,316,153,346,157,...,323,54,44,292,230,20,192,327,183,23
3800,59,349,196,92,82,0,323,269,140,257,...,235,249,114,278,37,61,258,362,122,23
17078,100,171,339,123,180,138,164,316,166,69,...,48,26,301,50,238,124,110,39,187,23

In [116]:
(birthday.unique_bdays < 23).mean()
#ok this is better

0.50598

### What if it's 20 people? 40?

In [118]:
n_trials = 100_000
n_bdays = 20
#i need to assign a numbered birthday to each person in the trial, then see if the total is n or less
birthday = np.random.choice([r for r in range(366)],size = (n_trials, n_bdays))
birthday = pd.DataFrame(birthday)
#good up to here, but i need to check unique values, not just sum up. 'nunique' will work
birthday['unique_bdays'] = birthday.nunique(axis = 1)
(birthday.unique_bdays < 20).mean()

0.4102

In [119]:
n_trials = 100_000
n_bdays = 40
#i need to assign a numbered birthday to each person in the trial, then see if the total is n or less
birthday = np.random.choice([r for r in range(366)],size = (n_trials, n_bdays))
birthday = pd.DataFrame(birthday)
#good up to here, but i need to check unique values, not just sum up. 'nunique' will work
birthday['unique_bdays'] = birthday.nunique(axis = 1)
(birthday.unique_bdays < 40).mean()

0.88977

# JOHN'S ANSWER, SINCE MINE was INCORRECT

In [103]:
def shared_birthday(people):

    nrows = 100_000 # set rows to number of simulations
    ncols = people  # set columns to number of people in each simulation

    # create array with each value representing the numbered day of the year that person was born on. (This ignores leap years)
    # reshape the aray into trial groups
    sightings = np.random.choice([r for r in range(366)], nrows * ncols).reshape(nrows, ncols)

    # convert to data frame
    df = pd.DataFrame(sightings)

    # Add boolian column to df showing weather there are less unique numbers in each row (trial) than there are total columns
    df['matching_birthdays'] = df.nunique(axis=1) < ncols

    # get mean of calculation True/False columns
    # format and print results
    matching_birthdays = df['matching_birthdays'].mean()

    # print result
    print(f'The odds of a room of {ncols} people having at least two people that share a birthday are {round(matching_birthdays*100)}%')

In [46]:
num_list = [23, 20, 40]

for num in num_list:
    shared_birthday(num)

The odds of a room of 23 people having at least two people that share a birthday are 51%
The odds of a room of 20 people having at least two people that share a birthday are 41%
The odds of a room of 40 people having at least two people that share a birthday are 89%

In [105]:
shared_birthday(23)

The odds of a room of 23 people having at least two people that share a birthday are 50%

In [108]:
nrows = 100_000 # set rows to number of simulations
ncols = 23  # set columns to number of people in each simulation

# create array with each value representing the numbered day of the year that person was born on. (This ignores leap years)
# reshape the aray into trial groups
sightings = np.random.choice([r for r in range(366)], nrows * ncols).reshape(nrows, ncols)

# convert to data frame
df = pd.DataFrame(sightings)
df['matching_birthdays'] = df.nunique(axis=1) < ncols
df.sample(10)

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,matching_birthdays
18410,269,4,188,192,273,327,339,252,341,346,...,335,303,54,179,251,120,75,215,245,False
53838,332,234,138,296,254,261,59,145,263,239,...,69,1,124,206,188,311,352,294,151,False
72456,40,189,77,169,118,173,351,127,239,122,...,355,279,138,299,160,159,363,240,305,True
40173,215,196,11,35,44,194,2,68,336,181,...,171,222,280,305,91,273,63,355,268,False
48076,306,324,326,151,87,244,358,257,323,116,...,348,226,116,355,228,300,342,319,140,True
39180,165,107,334,354,30,123,327,151,331,111,...,347,324,36,65,336,162,330,36,77,True
75989,18,318,331,236,196,61,272,249,62,74,...,320,323,291,139,332,31,122,320,334,True
19469,284,187,107,31,186,53,312,124,331,147,...,11,306,20,236,245,184,266,296,3,False
80253,182,144,170,297,247,339,277,337,252,337,...,257,152,283,63,183,321,330,36,159,True
62062,63,301,245,172,7,132,226,59,350,10,...,165,18,60,261,205,266,184,139,57,False

In [109]:
matching_birthdays = df['matching_birthdays'].mean()

In [110]:
matching_birthdays

0.50742